{
  "timestamp": "2025-07-29T19:30:51.928Z",
  "url": "https://www.yelp.com/biz/agora-dc-washington-8",
  "totalComments": 10,
  "extractedAt": "29.07.2025 22:30:51",
  "comments": [
    {
      "page": 1,
      "commentNumber": 1,
      "text": "we loved our agora dc experience!\n\ncame for date night on a tuesday at 6pm. it did start to fill up, so i highly recommend making a reservation. the interior has a nice aesthetic but it's not super large. lots of covered outdoor seating as well. street parking.\n\nour service was amazing. perfectly attentive but not overbearing.\n\neverything we ate was DELICIOUS! we got 6 plates for 2 hungry big-eaters but could've gotten by with 5. some are larger than others. the cauliflower, sis tavuk, and anadolu manti were particularly delightful!\n\ni will absolutely be coming back!"
    },
    {
      "page": 1,
      "commentNumber": 2,
      "text": "We were quite disappointed by our experience here, particularly as our experiences have been so positive at the Tysons Corner location.\n\nTo begin with, although the restaurant was not particularly crowded, the service was very slow and inattentive. We seemed to be waited on by two people, but it was unclear. The food was average, and most items took a while to come out. Among other things, we ordered the anadolu manti (dumplings) which are limited quantity, but they were a bit overcooked and disappointing. Frankly, our highlight was probably the spread sampler, and not any particular entree.\n\nIt took quite a while to receive our check and then upon leaving we were urged by one of the service staff to leave a review...so alas, here we are. Overall, there are many other options to choose from in the heart of Dupont or downtown, and I'd recommend doing so."
    },
    {
      "page": 1,
      "commentNumber": 3,
      "text": "service is good.\n\ngood place to go for large groups. I came here at 8:30pm and there was no wait and we got seated immediately.\n\ncacik was good and would order again. it was recommended over the labneh.\n\ngrilled octopus 5/5 the octopus was so good. I'm not a bean person and I enjoyed the beans.\n\nlamb chops were super good. I loved the broccolini and red onions and would order again.\n\nanadolu manti is delicious and also would order again.\n\nI wanna come back and try more dishes"
    },
    {
      "page": 1,
      "commentNumber": 4,
      "text": "We had a reservation for two (I recommend making a reservation) & came here for brunch.\n\nOverall, a solid place for small bites, drinks & quality food & the service is really great!\n\nWe did the bottomless brunch & enjoyed mostly everything we were served. We tried a bit of everything on the bottomless brunch menu.\n\nI would definitely come back here to give the dinner menu a try!"
    },
    {
      "page": 1,
      "commentNumber": 5,
      "text": "I had never had Turkish food before this, and I did not know what to expect. We came here because the other place we wanted had too long of a wait.\n\nIt was actually really good. I got the prawns, the rice, and the tomato salad. Everything came quickly (except the shrimp) and tasted really good. We were able to get in and out within our limited timeframe, which was excellent.\n\nThe service was efficient and really good. The restaurant had an elegant ambiance but we were in leggings lol so clearly they are welcoming\n\nI would definitely go back!"
    },
    {
      "page": 1,
      "commentNumber": 6,
      "text": "We brought our mothers here for Mother's Day because we wanted to try something different from our usual spots of Remi's Kitchen and Ilili. The restaurant is beautifully decorated, we were seated upstairs. The initial table offered to us was not suitable for 6 people, and when we approached the table it had five chairs. However once pointed out we requested another table.\n\nThe food comes out as it's ready with the intention to curate a family style meal. As for the food we ordered: hummus, roasted beetroot salad, Tabbouleh salad, ottoman rice, cauliflower, imam bayildi, grilled prawns, branzino, lamb chops x3, and grilled chicken. We were also accidentally brought htipiti.\n\nSome of the highlight were the hummus, beetroot salad, cauliflower, and eggplant. The proteins were unfortunately underwhelming as the lamb was fatty, the prawns slightly overcooked and chewy. The branzino and chicken were fine.\n\nService was a tad slow but our waiter was kind and acknowledged that we were celebrating our mothers. I would give it another try and possibly switch up the proteins."
    },
    {
      "page": 1,
      "commentNumber": 7,
      "text": "Wow, what a meal. We went for my wife's birthday! We began with the Spread Sampler... the Lebnah and tzatziki was especially good. We then had a cauliflower dish that was out of this world. Zatar with chicken and octopus were delightful. Actually too much food. This place will be on our list every time. Our server was great as was the vibe. Really great..."
    },
    {
      "page": 1,
      "commentNumber": 8,
      "text": "Agora is in a prime location surrounded by iconic DC restaurants. The interior is absolutely stunning and there is plenty of seating inside and outside. The staff was incredibly nice and attentive.\n\nWe got the sampler for the table which included a tasting of various spreads. The table's favorite spread was the Taramasalata. It consisted of cod roe mousse, olive oil and fresh lemon juice.\n\nDropping a star because it is slightly confusing with portion sizes. I ordered the Sis Tavuk which came with chicken thighs. The staff said the portion was only two small pieces so we over ordered. It ended up being two huge chicken pieces, one thigh and one breast. We felt that we were being told the same with all the other items, sometimes it was true while other times it was not.\n\nWe tried some of the pides! In general, there is a variety of items on the menu and something for everyone."
    },
    {
      "page": 1,
      "commentNumber": 9,
      "text": "Beautiful brunch experience! Funny that I went to see cherry blossoms at tidal basin both before and after this brunch, but I guess that's just a spring Saturday in DC~ Anyway, outdoor seating is gorgeous with cutie trees and natural lighting that makes your food and friends all look amazing. This is a great place to go full send and do the bottomless menu because it's a joy to try and share everything. Food is beautiful and delicious and plentiful. Service is bustling and great. We also got bottomless drinks, which came with four juices and glasses that the servers would hilariously re-fill with pitchers of champagne. The vibes are joyful and the place is packed with so many happy tables of people enjoying the day."
    },
    {
      "page": 1,
      "commentNumber": 10,
      "text": "I've been here a couple of times. My first experience was a solo experience. And I would say I much enjoyed that experience. The second time that I came was with a large party! Service was great. The food was great. However, I feel like I wasn't able to enjoy the amazing food that this restaurant had to offer. Simply because it was a large party and everything is served family style. That takes away nothing from the restaurant, just my personal preference and note to others! I think we spent too much time talking rather than enjoying the delicious food that Agora has to offer! I will say I am thankful they are able to accommodate large parties. And I'll be back soon for another brunch experience with less people! lol"
    }
  ]
}